app/controllers/photos_controller.rb

  def create
    photo = Photo.create(file: params[:file])
---
INSERT INTO "photos" ("file", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["file", "3.png"], ["created_at", "2016-03-12 09:04:49.609553"], ["updated_at", "2016-03-12 09:04:49.609553"]]